*** crates/vernal-context/src/application_build_error.rs:137:9: replace <impl Error for ApplicationBuildError>::source -> Option<&(dyn Error +'static)> with None

*** mutation diff:
--- crates/vernal-context/src/application_build_error.rs
+++ replace <impl Error for ApplicationBuildError>::source -> Option<&(dyn Error +'static)> with None
@@ -129,28 +129,17 @@
                 )
             }
         }
     }
 }
 
 impl Error for ApplicationBuildError {
     fn source(&self) -> Option<&(dyn Error + 'static)> {
-        match self {
-            Self::TokioRuntimeUnavailable { source } => Some(source),
-            Self::Definition { source } => Some(source),
-            Self::Graph { source } => Some(source),
-            Self::Context { source } => Some(source),
-            Self::Condition { source } => Some(source),
-            Self::AdvisorResolution { source, .. }
-            | Self::LocalAdvisorResolution { source, .. } => Some(source.as_ref()),
-            Self::AdvisorScope { .. } => None,
-            Self::OperationMetadata { source } => Some(source),
-            Self::AopCatalogInitialization { source } => Some(source),
-        }
+        None /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl From<DefinitionError> for ApplicationBuildError {
     fn from(source: DefinitionError) -> Self {
         Self::Definition { source }
     }
 }

---- custom_condition_failure_is_redacted_but_preserves_explicit_source_chain stdout ----

thread 'custom_condition_failure_is_redacted_but_preserves_explicit_source_chain' (3124470) panicked at crates/vernal-context/tests/conditional_components.rs:292:42:
condition error

failures:
    custom_condition_failure_is_redacted_but_preserves_explicit_source_chain

test result: FAILED. 5 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
