*** crates/vernal-context/src/application_build_error.rs:76:9: replace <impl fmt::Display for ApplicationBuildError>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/vernal-context/src/application_build_error.rs
+++ replace <impl fmt::Display for ApplicationBuildError>::fmt -> fmt::Result with Ok(Default::default())
@@ -68,72 +68,17 @@
     AopCatalogInitialization {
         /// 目录返回的一次封存错误。
         source: InvocationPlanCatalogInitializationError,
     },
 }
 
 impl fmt::Display for ApplicationBuildError {
     fn fmt(&self, formatter: &mut fmt::Formatter<'_>) -> fmt::Result {
-        match self {
-            Self::TokioRuntimeUnavailable { source } => {
-                write!(formatter, "Tokio runtime is unavailable: {source}")
-            }
-            Self::Definition { source } => {
-                write!(
-                    formatter,
-                    "application component definition is invalid: {source}"
-                )
-            }
-            Self::Graph { source } => {
-                write!(
-                    formatter,
-                    "application dependency graph is invalid: {source}"
-                )
-            }
-            Self::Context { source } => {
-                write!(formatter, "application context cannot be built: {source}")
-            }
-            Self::Condition { source } => {
-                write!(
-                    formatter,
-                    "application conditional component assembly failed: {source}"
-                )
-            }
-            Self::AdvisorResolution { component, source } => {
-                write!(
-                    formatter,
-                    "application advisor component {component} cannot be resolved: {source}"
-                )
-            }
-            Self::LocalAdvisorResolution { component, source } => {
-                write!(
-                    formatter,
-                    "application local advisor component {component} cannot be resolved: {source}"
-                )
-            }
-            Self::AdvisorScope { component, scope } => {
-                write!(
-                    formatter,
-                    "application advisor component {component} must be singleton, not {scope}"
-                )
-            }
-            Self::OperationMetadata { source } => {
-                write!(
-                    formatter,
-                    "application operation metadata is inconsistent: {source}"
-                )
-            }
-            Self::AopCatalogInitialization { source } => {
-                write!(
-                    formatter,
-                    "application AOP catalog cannot be initialized: {source}"
-                )
-            }
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl Error for ApplicationBuildError {
     fn source(&self) -> Option<&(dyn Error + 'static)> {
         match self {
             Self::TokioRuntimeUnavailable { source } => Some(source),
             Self::Definition { source } => Some(source),

---- application_build_error_tokio_runtime_unavailable_display stdout ----

thread 'application_build_error_tokio_runtime_unavailable_display' (3109381) panicked at crates/vernal-context/tests/module_coverage.rs:235:5:
assertion failed: display.contains("runtime") || display.contains("Tokio")

failures:
    application_build_error_tokio_runtime_unavailable_display

test result: FAILED. 9 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
