*** crates/vernal-context/src/application_close_coordinator.rs:107:9: replace ApplicationCloseCoordinator::record_warning with ()

*** mutation diff:
--- crates/vernal-context/src/application_close_coordinator.rs
+++ replace ApplicationCloseCoordinator::record_warning with ()
@@ -99,17 +99,17 @@
     pub(crate) async fn startup_report(&self, unused_definitions: Vec<String>) -> StartupReport {
         let mut report = self.diagnostics.lock().await.clone();
         report.set_unused_definitions(unused_definitions);
         report
     }
 
     /// 记录一个低基数静态运行期告警代码。
     pub(crate) async fn record_warning(&self, warning: &'static str) {
-        self.diagnostics.lock().await.record_warning(warning);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// 将生命周期超时转换成低基数、无业务正文的运行期告警代码。
     pub(crate) async fn record_lifecycle_warning(&self, error: &ContextError) {
         if let ContextError::LifecycleTimeout { abort_settled, .. } = error {
             self.record_warning("context.lifecycle-hook.timeout").await;
             if !abort_settled {
                 self.record_warning("context.lifecycle-hook.abort-unsettled")

---- runner_failure_short_circuits_later_work_rolls_back_and_redacts_defaults stdout ----

thread 'runner_failure_short_circuits_later_work_rolls_back_and_redacts_defaults' (5415232) panicked at crates/vernal-context/tests/application_runners.rs:138:5:
assertion failed: report.warnings().contains(&"context.application-runner.failed".to_owned())

failures:
    runner_failure_short_circuits_later_work_rolls_back_and_redacts_defaults

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
