*** crates/vernal-context/src/application_close_coordinator.rs:129:9: replace ApplicationCloseCoordinator::record_observation with ()

*** mutation diff:
--- crates/vernal-context/src/application_close_coordinator.rs
+++ replace ApplicationCloseCoordinator::record_observation with ()
@@ -121,26 +121,17 @@
     /// 追加一条不包含底层错误正文的生命周期观测。
     pub(crate) async fn record_observation(
         &self,
         subject: impl Into<String>,
         phase: DiagnosticPhase,
         outcome: DiagnosticOutcome,
         started: Instant,
     ) {
-        let elapsed_microseconds = u64::try_from(started.elapsed().as_micros()).unwrap_or(u64::MAX);
-        self.diagnostics
-            .lock()
-            .await
-            .record(StartupObservation::new(
-                subject.into(),
-                phase,
-                outcome,
-                elapsed_microseconds,
-            ));
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// 停止应用任务监督器，并仅向公开诊断写入稳定错误代码。
     pub(crate) async fn shutdown_managed_tasks(&self) -> Option<ManagedTaskError> {
         let supervisor = self.resources.managed_tasks()?;
         let error = supervisor
             .shutdown(*self.resources.task_shutdown_policy())
             .await

---- runner_failure_short_circuits_later_work_rolls_back_and_redacts_defaults stdout ----

thread 'runner_failure_short_circuits_later_work_rolls_back_and_redacts_defaults' (2418999) panicked at crates/vernal-context/tests/application_runners.rs:143:5:
assertion failed: report.observations().iter().any(|observation|
        {
            observation.phase() == DiagnosticPhase::ApplicationRunner &&
                    observation.outcome() == DiagnosticOutcome::Failed &&
                !observation.subject().contains("secret-runner-downstream-response")
        })

---- runners_follow_dependency_order_between_lifecycle_start_and_ready_fact stdout ----

thread 'runners_follow_dependency_order_between_lifecycle_start_and_ready_fact' (2419002) panicked at crates/vernal-context/tests/application_runners.rs:71:5:
startup report must expose a redacted successful runner observation

failures:
    runner_failure_short_circuits_later_work_rolls_back_and_redacts_defaults
    runners_follow_dependency_order_between_lifecycle_start_and_ready_fact

test result: FAILED. 5 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
