*** crates/vernal-context/src/application_close_coordinator.rs:163:9: replace ApplicationCloseCoordinator::stop_component -> Result<(), ContextError> with Ok(())

*** mutation diff:
--- crates/vernal-context/src/application_close_coordinator.rs
+++ replace ApplicationCloseCoordinator::stop_component -> Result<(), ContextError> with Ok(())
@@ -155,40 +155,17 @@
     /// 在独立 Tokio task 中执行一个组件停止钩子。
     ///
     /// 单个用户钩子 panic 只会转化为该组件的结构化失败，协调器仍会继续停止其余
     /// 组件。组件名在提交任务前取得，诊断路径不会读取用户错误正文。
     pub(crate) async fn stop_component(
         &self,
         component: &Arc<dyn Lifecycle>,
     ) -> Result<(), ContextError> {
-        let started = Instant::now();
-        let name = component.name();
-        let owned_component = Arc::clone(component);
-        let task = tokio::spawn(async move { owned_component.stop().await });
-        let policy = *self.resources.lifecycle_execution_policy();
-        let result = LifecycleTaskExecutor::execute(
-            task,
-            name,
-            LifecyclePhase::Stop,
-            policy.stop_timeout(),
-            policy.abort_timeout(),
-        )
-        .await;
-        let outcome = if result.is_ok() {
-            DiagnosticOutcome::Succeeded
-        } else {
-            DiagnosticOutcome::Failed
-        };
-        self.record_observation(name, DiagnosticPhase::Stop, outcome, started)
-            .await;
-        if let Err(error) = &result {
-            self.record_lifecycle_warning(error).await;
-        }
-        result
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// 逆序停止全部组件、隔离每个钩子的 panic，并保留第一个错误。
     pub(crate) async fn stop_all(&self, components: &[Arc<dyn Lifecycle>]) -> Option<ContextError> {
         let mut first_error = None;
         for component in components.iter().rev() {
             let stop_error = self.stop_component(component).await.err();
             if first_error.is_none() {

---- launch_start_failure_rolls_back_initialized_component_and_reports_closed stdout ----

thread 'launch_start_failure_rolls_back_initialized_component_and_reports_closed' (2442949) panicked at crates/vernal-context/tests/application_launch.rs:137:5:
assertion `left == right` failed
  left: ["start-failure:initialize", "start-failure:start"]
 right: ["start-failure:initialize", "start-failure:start", "start-failure:stop"]

---- launch_returns_shared_ready_context_and_close_remains_explicit stdout ----

thread 'launch_returns_shared_ready_context_and_close_remains_explicit' (2442948) panicked at crates/vernal-context/tests/application_launch.rs:45:5:
assertion `left == right` failed
  left: ["success:initialize", "success:start"]
 right: ["success:initialize", "success:start", "success:stop"]

---- cancelling_launch_waiter_finishes_startup_then_closes_orphan_context stdout ----

thread 'cancelling_launch_waiter_finishes_startup_then_closes_orphan_context' (2442945) panicked at crates/vernal-context/tests/application_launch_support/launch_probe.rs:46:13:
timed out waiting for launch event blocking:stop

failures:
    cancelling_launch_waiter_finishes_startup_then_closes_orphan_context
    launch_returns_shared_ready_context_and_close_remains_explicit
    launch_start_failure_rolls_back_initialized_component_and_reports_closed

test result: FAILED. 2 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.00s

*** result: Failure(101)
