*** crates/vernal-context/src/application_close_coordinator.rs:191:9: replace ApplicationCloseCoordinator::stop_all -> Option<ContextError> with None

*** mutation diff:
--- crates/vernal-context/src/application_close_coordinator.rs
+++ replace ApplicationCloseCoordinator::stop_all -> Option<ContextError> with None
@@ -183,24 +183,17 @@
         if let Err(error) = &result {
             self.record_lifecycle_warning(error).await;
         }
         result
     }
 
     /// 逆序停止全部组件、隔离每个钩子的 panic，并保留第一个错误。
     pub(crate) async fn stop_all(&self, components: &[Arc<dyn Lifecycle>]) -> Option<ContextError> {
-        let mut first_error = None;
-        for component in components.iter().rev() {
-            let stop_error = self.stop_component(component).await.err();
-            if first_error.is_none() {
-                first_error = stop_error;
-            }
-        }
-        first_error
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// 在独立 Tokio task 中执行一个组件暂停钩子。
     ///
     /// 对标 Spring 7.0 `SmartLifecycle#isPauseable()`：调用方负责过滤
     /// `is_pauseable() == false` 的组件；本方法只执行 `pause()` 并按
     /// `LifecyclePhase::Pause` 阶段记录诊断。超时与 abort 行为与
     /// [`Self::stop_component`] 完全一致，使暂停失败的诊断路径与 stop 失败一致。

---- launch_start_failure_rolls_back_initialized_component_and_reports_closed stdout ----

thread 'launch_start_failure_rolls_back_initialized_component_and_reports_closed' (5452202) panicked at crates/vernal-context/tests/application_launch.rs:137:5:
assertion `left == right` failed
  left: ["start-failure:initialize", "start-failure:start"]
 right: ["start-failure:initialize", "start-failure:start", "start-failure:stop"]

---- launch_returns_shared_ready_context_and_close_remains_explicit stdout ----

thread 'launch_returns_shared_ready_context_and_close_remains_explicit' (5452200) panicked at crates/vernal-context/tests/application_launch.rs:45:5:
assertion `left == right` failed
  left: ["success:initialize", "success:start"]
 right: ["success:initialize", "success:start", "success:stop"]

---- cancelling_launch_waiter_finishes_startup_then_closes_orphan_context stdout ----

thread 'cancelling_launch_waiter_finishes_startup_then_closes_orphan_context' (5452197) panicked at crates/vernal-context/tests/application_launch_support/launch_probe.rs:46:13:
timed out waiting for launch event blocking:stop

failures:
    cancelling_launch_waiter_finishes_startup_then_closes_orphan_context
    launch_returns_shared_ready_context_and_close_remains_explicit
    launch_start_failure_rolls_back_initialized_component_and_reports_closed

test result: FAILED. 2 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.01s

*** result: Failure(101)
