*** crates/vernal-context/src/application_close_coordinator.rs:211:9: replace ApplicationCloseCoordinator::pause_component -> Result<(), ContextError> with Ok(())

*** mutation diff:
--- crates/vernal-context/src/application_close_coordinator.rs
+++ replace ApplicationCloseCoordinator::pause_component -> Result<(), ContextError> with Ok(())
@@ -203,40 +203,17 @@
     /// 对标 Spring 7.0 `SmartLifecycle#isPauseable()`：调用方负责过滤
     /// `is_pauseable() == false` 的组件；本方法只执行 `pause()` 并按
     /// `LifecyclePhase::Pause` 阶段记录诊断。超时与 abort 行为与
     /// [`Self::stop_component`] 完全一致，使暂停失败的诊断路径与 stop 失败一致。
     pub(crate) async fn pause_component(
         &self,
         component: &Arc<dyn Lifecycle>,
     ) -> Result<(), ContextError> {
-        let started = Instant::now();
-        let name = component.name();
-        let owned_component = Arc::clone(component);
-        let task = tokio::spawn(async move { owned_component.pause().await });
-        let policy = *self.resources.lifecycle_execution_policy();
-        let result = LifecycleTaskExecutor::execute(
-            task,
-            name,
-            LifecyclePhase::Pause,
-            policy.stop_timeout(),
-            policy.abort_timeout(),
-        )
-        .await;
-        let outcome = if result.is_ok() {
-            DiagnosticOutcome::Succeeded
-        } else {
-            DiagnosticOutcome::Failed
-        };
-        self.record_observation(name, DiagnosticPhase::Pause, outcome, started)
-            .await;
-        if let Err(error) = &result {
-            self.record_lifecycle_warning(error).await;
-        }
-        result
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// 逆序暂停全部可暂停组件、隔离每个钩子的 panic，并保留第一个错误。
     ///
     /// 对标 Spring `DefaultLifecycleProcessor#stopBeans(true)`：只停止
     /// `SmartLifecycle#isPauseable()` 返回 `true` 的组件。组件顺序与
     /// [`Self::stop_all`] 一致（按依赖逆序），让可暂停组件能假定被它依赖的
     /// 上游组件已经暂停。

---- pause_only_invokes_pausable_components stdout ----

thread 'pause_only_invokes_pausable_components' (5458670) panicked at crates/vernal-context/tests/lifecycle_pause_restart_tests.rs:185:5:
assertion `left == right` failed
  left: 0
 right: 1

---- restart_invokes_pausable_components_start stdout ----

thread 'restart_invokes_pausable_components_start' (5458673) panicked at crates/vernal-context/tests/lifecycle_pause_restart_tests.rs:222:5:
assertion `left == right` failed
  left: 0
 right: 1

---- pause_failure_closes_context stdout ----

thread 'pause_failure_closes_context' (5458668) panicked at crates/vernal-context/tests/lifecycle_pause_restart_tests.rs:536:5:
pause must fail when component pauses fail

failures:
    multiple_pause_restart_cycles
    pause_failure_closes_context
    pause_only_invokes_pausable_components
    pause_then_close_stops_all_components
    restart_invokes_pausable_components_start

test result: FAILED. 5 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
