*** crates/vernal-context/src/application_close_coordinator.rs:247:9: replace ApplicationCloseCoordinator::pause_all -> Option<ContextError> with None

*** mutation diff:
--- crates/vernal-context/src/application_close_coordinator.rs
+++ replace ApplicationCloseCoordinator::pause_all -> Option<ContextError> with None
@@ -239,27 +239,17 @@
     /// 对标 Spring `DefaultLifecycleProcessor#stopBeans(true)`：只停止
     /// `SmartLifecycle#isPauseable()` 返回 `true` 的组件。组件顺序与
     /// [`Self::stop_all`] 一致（按依赖逆序），让可暂停组件能假定被它依赖的
     /// 上游组件已经暂停。
     pub(crate) async fn pause_all(
         &self,
         components: &[Arc<dyn Lifecycle>],
     ) -> Option<ContextError> {
-        let mut first_error = None;
-        for component in components.iter().rev() {
-            if !component.is_pauseable() {
-                continue;
-            }
-            let pause_error = self.pause_component(component).await.err();
-            if first_error.is_none() {
-                first_error = pause_error;
-            }
-        }
-        first_error
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// 启动唯一关闭协调任务并等待共享结果。
     ///
     /// 当前等待者被取消不会影响后台协调器。低层 Context 没有预绑定 Runtime 时，
     /// 会使用调用现场的 Tokio Handle；两者都不存在时返回结构化协调错误。
     pub(crate) async fn close(self: &Arc<Self>) -> CloseResult {
         self.start_close()?;

---- pause_failure_closes_context stdout ----

thread 'pause_failure_closes_context' (5465637) panicked at crates/vernal-context/tests/lifecycle_pause_restart_tests.rs:536:5:
pause must fail when component pauses fail

---- pause_only_invokes_pausable_components stdout ----

thread 'pause_only_invokes_pausable_components' (5465639) panicked at crates/vernal-context/tests/lifecycle_pause_restart_tests.rs:185:5:
assertion `left == right` failed
  left: 0
 right: 1

---- restart_invokes_pausable_components_start stdout ----

thread 'restart_invokes_pausable_components_start' (5465642) panicked at crates/vernal-context/tests/lifecycle_pause_restart_tests.rs:222:5:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    multiple_pause_restart_cycles
    pause_failure_closes_context
    pause_only_invokes_pausable_components
    pause_then_close_stops_all_components
    restart_invokes_pausable_components_start

test result: FAILED. 5 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
