*** crates/vernal-context/src/application_close_coordinator.rs:249:16: delete ! in ApplicationCloseCoordinator::pause_all

*** mutation diff:
--- crates/vernal-context/src/application_close_coordinator.rs
+++ delete ! in ApplicationCloseCoordinator::pause_all
@@ -241,17 +241,17 @@
     /// [`Self::stop_all`] 一致（按依赖逆序），让可暂停组件能假定被它依赖的
     /// 上游组件已经暂停。
     pub(crate) async fn pause_all(
         &self,
         components: &[Arc<dyn Lifecycle>],
     ) -> Option<ContextError> {
         let mut first_error = None;
         for component in components.iter().rev() {
-            if !component.is_pauseable() {
+            if  /* ~ changed by cargo-mutants ~ */component.is_pauseable() {
                 continue;
             }
             let pause_error = self.pause_component(component).await.err();
             if first_error.is_none() {
                 first_error = pause_error;
             }
         }
         first_error

---- pause_then_close_stops_all_components stdout ----

thread 'pause_then_close_stops_all_components' (5472426) panicked at crates/vernal-context/tests/lifecycle_pause_restart_tests.rs:386:5:
assertion `left == right` failed
  left: 0
 right: 1

---- pause_only_invokes_pausable_components stdout ----

thread 'pause_only_invokes_pausable_components' (5472425) panicked at crates/vernal-context/tests/lifecycle_pause_restart_tests.rs:185:5:
assertion `left == right` failed
  left: 0
 right: 1

---- pause_failure_closes_context stdout ----

thread 'pause_failure_closes_context' (5472423) panicked at crates/vernal-context/tests/lifecycle_pause_restart_tests.rs:536:5:
pause must fail when component pauses fail

failures:
    multiple_pause_restart_cycles
    pause_failure_closes_context
    pause_only_invokes_pausable_components
    pause_then_close_stops_all_components
    restart_invokes_pausable_components_start

test result: FAILED. 5 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
