*** crates/vernal-context/src/application_close_coordinator.rs:322:31: replace == with != in ApplicationCloseCoordinator::finish_close

*** mutation diff:
--- crates/vernal-context/src/application_close_coordinator.rs
+++ replace == with != in ApplicationCloseCoordinator::finish_close
@@ -314,17 +314,17 @@
             observer.close_result.send_replace(Some(result));
         });
         Ok(())
     }
 
     /// 在后台完成任务排空、组件逆序停止和 Closed 终态发布。
     async fn finish_close(&self) -> CloseResult {
         let _operation = self.operation.lock().await;
-        if self.state().await == ContextState::Closed {
+        if self.state().await != /* ~ changed by cargo-mutants ~ */ ContextState::Closed {
             return Ok(());
         }
 
         let draining_state = if self.state().await == ContextState::Ready {
             ContextState::Draining
         } else {
             ContextState::RollingBack
         };

---- listener_failure_cancels_application_and_redacts_default_error_text stdout ----

thread 'listener_failure_cancels_application_and_redacts_default_error_text' (5478880) panicked at crates/vernal-context/tests/application_event_listeners.rs:135:10:
task failure must surface: ()

failures:
    listener_failure_cancels_application_and_redacts_default_error_text

test result: FAILED. 5 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
