*** crates/vernal-context/src/application_close_coordinator.rs:68:9: replace ApplicationCloseCoordinator::push_component with ()

*** mutation diff:
--- crates/vernal-context/src/application_close_coordinator.rs
+++ replace ApplicationCloseCoordinator::push_component with ()
@@ -60,17 +60,17 @@
 
     /// 返回 Context 独占的内建运行资源。
     pub(crate) const fn resources(&self) -> &ContextResources {
         &self.resources
     }
 
     /// 把已经解析、需要在失败或关闭时释放的组件压入共享栈。
     pub(crate) async fn push_component(&self, component: Arc<dyn Lifecycle>) {
-        self.components.lock().await.push(component);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// 克隆当前组件栈，使启动过程不跨用户 Future 持有组件锁。
     pub(crate) async fn components(&self) -> Vec<Arc<dyn Lifecycle>> {
         self.components.lock().await.clone()
     }
 
     /// 取得组件栈所有权并清空共享位置，保证每个组件最多被一个回滚流程停止。

---- launch_returns_shared_ready_context_and_close_remains_explicit stdout ----

thread 'launch_returns_shared_ready_context_and_close_remains_explicit' (3136131) panicked at crates/vernal-context/tests/application_launch.rs:35:5:
assertion `left == right` failed
  left: ["success:initialize"]
 right: ["success:initialize", "success:start"]

---- launch_start_failure_rolls_back_initialized_component_and_reports_closed stdout ----

thread 'launch_start_failure_rolls_back_initialized_component_and_reports_closed' (3136132) panicked at crates/vernal-context/tests/application_launch.rs:121:18:
start failure should reject launch

---- cancelling_launch_waiter_finishes_startup_then_closes_orphan_context stdout ----

thread 'cancelling_launch_waiter_finishes_startup_then_closes_orphan_context' (3136128) panicked at crates/vernal-context/tests/application_launch_support/launch_probe.rs:46:13:
timed out waiting for launch event blocking:stop

failures:
    cancelling_launch_waiter_finishes_startup_then_closes_orphan_context
    launch_returns_shared_ready_context_and_close_remains_explicit
    launch_start_failure_rolls_back_initialized_component_and_reports_closed

test result: FAILED. 2 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.00s

*** result: Failure(101)
