*** crates/vernal-context/src/application_close_coordinator.rs:73:9: replace ApplicationCloseCoordinator::components -> Vec<Arc<dyn Lifecycle>> with vec![]

*** mutation diff:
--- crates/vernal-context/src/application_close_coordinator.rs
+++ replace ApplicationCloseCoordinator::components -> Vec<Arc<dyn Lifecycle>> with vec![]
@@ -65,17 +65,17 @@
 
     /// 把已经解析、需要在失败或关闭时释放的组件压入共享栈。
     pub(crate) async fn push_component(&self, component: Arc<dyn Lifecycle>) {
         self.components.lock().await.push(component);
     }
 
     /// 克隆当前组件栈，使启动过程不跨用户 Future 持有组件锁。
     pub(crate) async fn components(&self) -> Vec<Arc<dyn Lifecycle>> {
-        self.components.lock().await.clone()
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 
     /// 取得组件栈所有权并清空共享位置，保证每个组件最多被一个回滚流程停止。
     pub(crate) async fn take_components(&self) -> Vec<Arc<dyn Lifecycle>> {
         mem::take(&mut *self.components.lock().await)
     }
 
     /// 返回当前生命周期状态快照。

---- launch_returns_shared_ready_context_and_close_remains_explicit stdout ----

thread 'launch_returns_shared_ready_context_and_close_remains_explicit' (5387616) panicked at crates/vernal-context/tests/application_launch.rs:35:5:
assertion `left == right` failed
  left: ["success:initialize"]
 right: ["success:initialize", "success:start"]

---- launch_start_failure_rolls_back_initialized_component_and_reports_closed stdout ----

thread 'launch_start_failure_rolls_back_initialized_component_and_reports_closed' (5387617) panicked at crates/vernal-context/tests/application_launch.rs:121:18:
start failure should reject launch

---- cancelling_launch_waiter_finishes_startup_then_closes_orphan_context stdout ----

thread 'cancelling_launch_waiter_finishes_startup_then_closes_orphan_context' (5387613) panicked at crates/vernal-context/tests/application_launch.rs:168:5:
assertion `left == right` failed
  left: ["blocking:initialize-enter", "blocking:initialize-exit", "blocking:stop"]
 right: ["blocking:initialize-enter", "blocking:initialize-exit", "blocking:start", "blocking:stop"]

failures:
    cancelling_launch_waiter_finishes_startup_then_closes_orphan_context
    launch_returns_shared_ready_context_and_close_remains_explicit
    launch_start_failure_rolls_back_initialized_component_and_reports_closed

test result: FAILED. 2 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
