*** crates/vernal-context/src/application_close_coordinator.rs:78:9: replace ApplicationCloseCoordinator::take_components -> Vec<Arc<dyn Lifecycle>> with vec![]

*** mutation diff:
--- crates/vernal-context/src/application_close_coordinator.rs
+++ replace ApplicationCloseCoordinator::take_components -> Vec<Arc<dyn Lifecycle>> with vec![]
@@ -70,17 +70,17 @@
 
     /// 克隆当前组件栈，使启动过程不跨用户 Future 持有组件锁。
     pub(crate) async fn components(&self) -> Vec<Arc<dyn Lifecycle>> {
         self.components.lock().await.clone()
     }
 
     /// 取得组件栈所有权并清空共享位置，保证每个组件最多被一个回滚流程停止。
     pub(crate) async fn take_components(&self) -> Vec<Arc<dyn Lifecycle>> {
-        mem::take(&mut *self.components.lock().await)
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 
     /// 返回当前生命周期状态快照。
     pub(crate) async fn state(&self) -> ContextState {
         *self.state.read().await
     }
 
     /// 原子替换可观察状态，并同步更新脱敏诊断快照。

---- launch_start_failure_rolls_back_initialized_component_and_reports_closed stdout ----

thread 'launch_start_failure_rolls_back_initialized_component_and_reports_closed' (3160729) panicked at crates/vernal-context/tests/application_launch.rs:137:5:
assertion `left == right` failed
  left: ["start-failure:initialize", "start-failure:start"]
 right: ["start-failure:initialize", "start-failure:start", "start-failure:stop"]

---- launch_returns_shared_ready_context_and_close_remains_explicit stdout ----

thread 'launch_returns_shared_ready_context_and_close_remains_explicit' (3160728) panicked at crates/vernal-context/tests/application_launch.rs:45:5:
assertion `left == right` failed
  left: ["success:initialize", "success:start"]
 right: ["success:initialize", "success:start", "success:stop"]

---- cancelling_launch_waiter_finishes_startup_then_closes_orphan_context stdout ----

thread 'cancelling_launch_waiter_finishes_startup_then_closes_orphan_context' (3160725) panicked at crates/vernal-context/tests/application_launch_support/launch_probe.rs:46:13:
timed out waiting for launch event blocking:stop

failures:
    cancelling_launch_waiter_finishes_startup_then_closes_orphan_context
    launch_returns_shared_ready_context_and_close_remains_explicit
    launch_start_failure_rolls_back_initialized_component_and_reports_closed

test result: FAILED. 2 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.00s

*** result: Failure(101)
