*** crates/vernal-context/src/application_close_coordinator.rs:83:9: replace ApplicationCloseCoordinator::state -> ContextState with Default::default()

*** mutation diff:
--- crates/vernal-context/src/application_close_coordinator.rs
+++ replace ApplicationCloseCoordinator::state -> ContextState with Default::default()
@@ -75,17 +75,17 @@
 
     /// 取得组件栈所有权并清空共享位置，保证每个组件最多被一个回滚流程停止。
     pub(crate) async fn take_components(&self) -> Vec<Arc<dyn Lifecycle>> {
         mem::take(&mut *self.components.lock().await)
     }
 
     /// 返回当前生命周期状态快照。
     pub(crate) async fn state(&self) -> ContextState {
-        *self.state.read().await
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// 原子替换可观察状态，并同步更新脱敏诊断快照。
     pub(crate) async fn set_state(&self, state: ContextState) {
         *self.state.write().await = state;
         self.diagnostics
             .lock()
             .await

---- launch_returns_shared_ready_context_and_close_remains_explicit stdout ----

thread 'launch_returns_shared_ready_context_and_close_remains_explicit' (5400951) panicked at crates/vernal-context/tests/application_launch.rs:31:42:

---- launch_start_failure_rolls_back_initialized_component_and_reports_closed stdout ----

thread 'launch_start_failure_rolls_back_initialized_component_and_reports_closed' (5400952) panicked at crates/vernal-context/tests/application_launch.rs:137:5:
assertion `left == right` failed
  left: ["start-failure:initialize", "start-failure:stop"]
 right: ["start-failure:initialize", "start-failure:start", "start-failure:stop"]

---- cancelling_launch_waiter_finishes_startup_then_closes_orphan_context stdout ----

thread 'cancelling_launch_waiter_finishes_startup_then_closes_orphan_context' (5400948) panicked at crates/vernal-context/tests/application_launch.rs:168:5:
assertion `left == right` failed
  left: ["blocking:initialize-enter", "blocking:initialize-exit", "blocking:stop"]
 right: ["blocking:initialize-enter", "blocking:initialize-exit", "blocking:start", "blocking:stop"]

failures:
    cancelling_launch_waiter_finishes_startup_then_closes_orphan_context
    launch_returns_shared_ready_context_and_close_remains_explicit
    launch_start_failure_rolls_back_initialized_component_and_reports_closed

test result: FAILED. 2 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
