*** crates/vernal-context/src/application_close_coordinator.rs:88:9: replace ApplicationCloseCoordinator::set_state with ()

*** mutation diff:
--- crates/vernal-context/src/application_close_coordinator.rs
+++ replace ApplicationCloseCoordinator::set_state with ()
@@ -80,21 +80,17 @@
 
     /// 返回当前生命周期状态快照。
     pub(crate) async fn state(&self) -> ContextState {
         *self.state.read().await
     }
 
     /// 原子替换可观察状态，并同步更新脱敏诊断快照。
     pub(crate) async fn set_state(&self, state: ContextState) {
-        *self.state.write().await = state;
-        self.diagnostics
-            .lock()
-            .await
-            .set_context_state(state.as_str().to_owned());
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// 返回调用时刻拥有自身数据的诊断报告快照。
     ///
     /// `unused_definitions` 来自 Container 的同步解析追踪快照；这里只把它与同一
     /// 时刻的生命周期诊断值组合，不在协调器中保存第二份组件使用状态。
     pub(crate) async fn startup_report(&self, unused_definitions: Vec<String>) -> StartupReport {
         let mut report = self.diagnostics.lock().await.clone();

---- launch_start_failure_rolls_back_initialized_component_and_reports_closed stdout ----

thread 'launch_start_failure_rolls_back_initialized_component_and_reports_closed' (5406334) panicked at crates/vernal-context/tests/application_launch.rs:126:5:
assertion `left == right` failed
  left: "created"
 right: "closed"

---- launch_returns_shared_ready_context_and_close_remains_explicit stdout ----

thread 'launch_returns_shared_ready_context_and_close_remains_explicit' (5406333) panicked at crates/vernal-context/tests/application_launch.rs:31:42:

---- launch_refresh_failure_is_closed_and_reported_without_leaking_secret stdout ----

thread 'launch_refresh_failure_is_closed_and_reported_without_leaking_secret' (5406332) panicked at crates/vernal-context/tests/application_launch.rs:94:5:
assertion `left == right` failed
  left: "created"
 right: "closed"

failures:
    cancelling_launch_waiter_finishes_startup_then_closes_orphan_context
    launch_refresh_failure_is_closed_and_reported_without_leaking_secret
    launch_returns_shared_ready_context_and_close_remains_explicit
    launch_start_failure_rolls_back_initialized_component_and_reports_closed

test result: FAILED. 1 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
