*** crates/vernal-context/src/application_context.rs:111:9: replace ApplicationContext::refresh -> Result<(), ContextError> with Ok(())

*** mutation diff:
--- crates/vernal-context/src/application_context.rs
+++ replace ApplicationContext::refresh -> Result<(), ContextError> with Ok(())
@@ -103,17 +103,17 @@
     /// 或用户钩子 panic 时，观察任务仍会取消应用、逆序释放共享组件栈并进入确定
     /// 终态。
     ///
     /// # Errors
     ///
     /// Runtime 不可用、状态非法、组件解析/初始化失败或协调任务异常时返回
     /// [`ContextError`]。
     pub async fn refresh(&self) -> Result<(), ContextError> {
-        self.startup_coordinator.refresh().await
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// 按依赖顺序启动组件、执行 Runner、激活周期任务并进入 Ready。
     ///
     /// 实际 start 链由独立 Tokio task 持有。当前等待者被取消只会丢弃一次性结果
     /// 接收端；启动成功仍会提交 Ready，失败仍会完成逆序回滚。
     ///
     /// # Errors

---- listener_failure_cancels_application_and_redacts_default_error_text stdout ----

thread 'listener_failure_cancels_application_and_redacts_default_error_text' (5489849) panicked at crates/vernal-context/tests/application_event_listeners.rs:118:5:
assertion `left == right` failed
  left: 0
 right: 1

---- application_module_atomically_contributes_listener_component_and_subscription stdout ----

thread 'application_module_atomically_contributes_listener_component_and_subscription' (5489846) panicked at crates/vernal-context/tests/application_event_listeners.rs:50:5:
assertion `left == right` failed
  left: 0
 right: 1

---- refresh_subscribes_ioc_listener_before_lifecycle_initialize_publishes stdout ----

thread 'refresh_subscribes_ioc_listener_before_lifecycle_initialize_publishes' (5489850) panicked at crates/vernal-context/tests/application_event_listeners.rs:34:6:
managed listener should receive event: Elapsed(())

failures:
    application_module_atomically_contributes_listener_component_and_subscription
    listener_failure_cancels_application_and_redacts_default_error_text
    refresh_subscribes_ioc_listener_before_lifecycle_initialize_publishes

test result: FAILED. 3 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.00s

*** result: Failure(101)
