*** crates/vernal-context/src/application_context.rs:124:9: replace ApplicationContext::start -> Result<(), ContextError> with Ok(())

*** mutation diff:
--- crates/vernal-context/src/application_context.rs
+++ replace ApplicationContext::start -> Result<(), ContextError> with Ok(())
@@ -116,17 +116,17 @@
     /// 实际 start 链由独立 Tokio task 持有。当前等待者被取消只会丢弃一次性结果
     /// 接收端；启动成功仍会提交 Ready，失败仍会完成逆序回滚。
     ///
     /// # Errors
     ///
     /// Runtime 不可用、状态非法、任一 start/Runner/周期任务激活失败，或协调任务
     /// 异常时返回 [`ContextError`]。
     pub async fn start(&self) -> Result<(), ContextError> {
-        self.startup_coordinator.start().await
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// 暂停 Context —— 只停止声明 `is_pauseable() == true` 的组件。
     ///
     /// 对标 Spring 7.0 `ConfigurableApplicationContext#pause()` 与
     /// `LifecycleProcessor#onPause()`：Context 在 `Ready` 状态下调用本方法会
     /// 让可暂停组件按依赖逆序 `pause()`，然后进入 `Paused` 状态，并发布
     /// [`ApplicationPausedEvent`]。不可暂停组件保持运行；周期任务、事件

---- launch_returns_shared_ready_context_and_close_remains_explicit stdout ----

thread 'launch_returns_shared_ready_context_and_close_remains_explicit' (5496299) panicked at crates/vernal-context/tests/application_launch.rs:33:5:
assertion `left == right` failed
  left: Refreshed
 right: Ready

---- launch_start_failure_rolls_back_initialized_component_and_reports_closed stdout ----

thread 'launch_start_failure_rolls_back_initialized_component_and_reports_closed' (5496300) panicked at crates/vernal-context/tests/application_launch.rs:121:18:
start failure should reject launch

---- cancelling_launch_waiter_finishes_startup_then_closes_orphan_context stdout ----

thread 'cancelling_launch_waiter_finishes_startup_then_closes_orphan_context' (5496296) panicked at crates/vernal-context/tests/application_launch.rs:168:5:
assertion `left == right` failed
  left: ["blocking:initialize-enter", "blocking:initialize-exit", "blocking:stop"]
 right: ["blocking:initialize-enter", "blocking:initialize-exit", "blocking:start", "blocking:stop"]

failures:
    cancelling_launch_waiter_finishes_startup_then_closes_orphan_context
    launch_returns_shared_ready_context_and_close_remains_explicit
    launch_start_failure_rolls_back_initialized_component_and_reports_closed

test result: FAILED. 2 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
