*** crates/vernal-context/src/application_context.rs:144:9: replace ApplicationContext::pause -> Result<(), ContextError> with Ok(())

*** mutation diff:
--- crates/vernal-context/src/application_context.rs
+++ replace ApplicationContext::pause -> Result<(), ContextError> with Ok(())
@@ -136,17 +136,17 @@
     /// 接收端，已暂停组件不会恢复。
     ///
     /// # Errors
     ///
     /// Runtime 不可用、当前状态不是 `Ready`，或任一可暂停组件的 `pause()` 钩子
     /// 失败 / 超时 / panic 时返回 [`ContextError`]。失败会让 Context 进入完整
     /// 关闭路径（`close()`）。
     pub async fn pause(&self) -> Result<(), ContextError> {
-        self.startup_coordinator.pause().await
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// 从 `Paused` 状态恢复 —— 重新启动此前被暂停的组件。
     ///
     /// 对标 Spring 7.0 `ConfigurableApplicationContext#restart()` 与
     /// `LifecycleProcessor#onRestart()`：Context 在 `Paused` 状态下调用本方法
     /// 会重新调用可暂停组件的 `start()`，然后推回 `Ready` 状态，并重新发布
     /// [`ApplicationReadyEvent`]。

---- pause_failure_closes_context stdout ----

thread 'pause_failure_closes_context' (5505018) panicked at crates/vernal-context/tests/lifecycle_pause_restart_tests.rs:536:5:
pause must fail when component pauses fail

---- restart_invokes_pausable_components_start stdout ----

thread 'restart_invokes_pausable_components_start' (5505024) panicked at crates/vernal-context/tests/lifecycle_pause_restart_tests.rs:222:5:
assertion `left == right` failed
  left: 0
 right: 1

---- restart_skips_non_pausable_components stdout ----

thread 'restart_skips_non_pausable_components' (5505025) panicked at crates/vernal-context/tests/lifecycle_pause_restart_tests.rs:269:29:
restart: InvalidState { operation: "restart", state: Ready }

failures:
    multiple_pause_restart_cycles
    pause_emits_application_paused_event
    pause_failure_closes_context
    pause_from_invalid_state_fails
    pause_only_invokes_pausable_components
    pause_then_close_stops_all_components
    restart_invokes_pausable_components_start
    restart_skips_non_pausable_components

test result: FAILED. 2 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
