*** crates/vernal-context/src/application_context.rs:163:9: replace ApplicationContext::restart -> Result<(), ContextError> with Ok(())

*** mutation diff:
--- crates/vernal-context/src/application_context.rs
+++ replace ApplicationContext::restart -> Result<(), ContextError> with Ok(())
@@ -155,17 +155,17 @@
     /// 结果接收端，未完成重启的组件不会被回滚到 Paused。
     ///
     /// # Errors
     ///
     /// Runtime 不可用、当前状态不是 `Paused`，或任一可暂停组件的 `start()` 钩子
     /// 失败时返回 [`ContextError`]。失败会调用 `close()` 完成完整关闭，与启动
     /// 期失败处理一致。
     pub async fn restart(&self) -> Result<(), ContextError> {
-        self.startup_coordinator.restart().await
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// 幂等关闭上下文。
     ///
     /// # Errors
     ///
     /// 返回第一个受管任务或 stop 错误，但仍会尝试关闭其余组件并最终进入 Closed。
     /// 关闭由唯一 Tokio 协调任务持有；丢弃当前调用者的 Future 不会中断资源释放，

---- restart_from_invalid_state_fails stdout ----

thread 'restart_from_invalid_state_fails' (5513518) panicked at crates/vernal-context/tests/lifecycle_pause_restart_tests.rs:336:5:
expected InvalidState, got Ok(())

---- restart_invokes_pausable_components_start stdout ----

thread 'restart_invokes_pausable_components_start' (5513519) panicked at crates/vernal-context/tests/lifecycle_pause_restart_tests.rs:227:5:
assertion `left == right` failed
  left: 1
 right: 2

---- multiple_pause_restart_cycles stdout ----

thread 'multiple_pause_restart_cycles' (5513512) panicked at crates/vernal-context/tests/lifecycle_pause_restart_tests.rs:421:9:
assertion `left == right` failed
  left: Paused
 right: Ready

failures:
    multiple_pause_restart_cycles
    restart_from_invalid_state_fails
    restart_invokes_pausable_components_start
    restart_skips_non_pausable_components

test result: FAILED. 6 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
