*** crates/vernal-context/src/application_context.rs:187:9: replace ApplicationContext::run_until_cancelled -> Result<(), ContextError> with Ok(())

*** mutation diff:
--- crates/vernal-context/src/application_context.rs
+++ replace ApplicationContext::run_until_cancelled -> Result<(), ContextError> with Ok(())
@@ -179,19 +179,17 @@
     /// 受管任务返回错误、发生 panic 或被异常取消时会取消应用令牌，因此服务主函数
     /// 可以在 `start()` 成功后等待本方法，把后台任务失败转换成 Context 关闭结果。
     /// 外部信号处理器也可以调用 [`CancellationToken::cancel`] 复用同一条关闭路径。
     ///
     /// # Errors
     ///
     /// 返回 [`Self::close`] 的第一个受管任务、组件停止或协调器错误。
     pub async fn run_until_cancelled(&self) -> Result<(), ContextError> {
-        let cancellation = self.cancellation_token();
-        cancellation.cancelled().await;
-        self.close().await
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// 等待应用内部取消或当前平台的第一个操作系统关闭信号，再完整关闭 Context。
     ///
     /// 受管任务失败可能先取消应用；Ctrl-C、Unix SIGTERM/SIGHUP 或 Windows
     /// 控制台信号也可能先到达。两条路径使用同一个取消令牌和关闭协调器，因而不会
     /// 重复 stop。操作系统信号会先作为 [`ApplicationShutdownSignal`] 发布到
     /// Context-local [`EventBus`]，随后立即取消应用；事件订阅方不能延迟关闭。

---- managed_task_failure_drives_run_until_cancelled_to_closed stdout ----

thread 'managed_task_failure_drives_run_until_cancelled_to_closed' (5528361) panicked at crates/vernal-context/tests/managed_tasks.rs:290:5:
assertion failed: matches!(context.run_until_cancelled().await,
    Err(ContextError::ManagedTask
    {
        source: ManagedTaskError::TaskFailed
        { task: "test.run-loop-failure", .. }
    }))

failures:
    managed_task_failure_drives_run_until_cancelled_to_closed

test result: FAILED. 9 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
