*** crates/vernal-context/src/application_context.rs:204:9: replace ApplicationContext::run_until_shutdown_signal -> Result<(), ContextError> with Ok(())

*** mutation diff:
--- crates/vernal-context/src/application_context.rs
+++ replace ApplicationContext::run_until_shutdown_signal -> Result<(), ContextError> with Ok(())
@@ -196,38 +196,17 @@
     /// 重复 stop。操作系统信号会先作为 [`ApplicationShutdownSignal`] 发布到
     /// Context-local [`EventBus`]，随后立即取消应用；事件订阅方不能延迟关闭。
     ///
     /// # Errors
     ///
     /// 返回 [`Self::close`] 的错误；Tokio 无法注册或继续观察系统信号时，会先
     /// 保守取消并关闭 Context，再返回 [`ContextError::ShutdownSignal`]。
     pub async fn run_until_shutdown_signal(&self) -> Result<(), ContextError> {
-        let cancellation = self.cancellation_token();
-        tokio::select! {
-            biased;
-            () = cancellation.cancelled() => self.close().await,
-            signal = self.shutdown_signal_listener().wait() => {
-                match signal {
-                    Ok(signal) => self.shutdown_on_signal(signal).await,
-                    Err(source) => {
-                        self.record_runtime_warning("context.shutdown-signal.listener-failed")
-                            .await;
-                        cancellation.cancel();
-                        if self.close().await.is_err() {
-                            self.record_runtime_warning("context.shutdown-signal.close-failed")
-                                .await;
-                        }
-                        Err(ContextError::ShutdownSignal {
-                            source: Arc::new(source),
-                        })
-                    }
-                }
-            }
-        }
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// 处理框架适配器或测试已经识别出的关闭信号。
     ///
     /// 该入口允许嵌入式宿主复用 Vernal 的信号事件、取消树与关闭顺序，而无需让
     /// Vernal 再次安装进程级监听器。信号事件先发布，随后取消应用并等待唯一关闭
     /// 协调器完成。
     ///

---- application_cancellation_wins_without_waiting_for_an_os_signal stdout ----

thread 'application_cancellation_wins_without_waiting_for_an_os_signal' (5536772) panicked at crates/vernal-context/tests/shutdown_signals.rs:58:5:
assertion `left == right` failed
  left: Ready
 right: Closed

failures:
    application_cancellation_wins_without_waiting_for_an_os_signal

test result: FAILED. 1 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
