*** crates/vernal-context/src/application_context.rs:248:9: replace ApplicationContext::state -> ContextState with Default::default()

*** mutation diff:
--- crates/vernal-context/src/application_context.rs
+++ replace ApplicationContext::state -> ContextState with Default::default()
@@ -240,17 +240,17 @@
     ) -> Result<(), ContextError> {
         let _delivered = self.events().publish(signal).await;
         self.cancellation_token().cancel();
         self.close().await
     }
 
     /// 返回当前状态快照。
     pub async fn state(&self) -> ContextState {
-        self.lifecycle().state().await
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     // ── Spring ApplicationContext metadata methods ─────────────────────
 
     /// 返回上下文唯一 ID。
     ///
     /// 对标 Spring `ApplicationContext#getId()`：Spring 7.0+ 标记 "never null"。
     /// vernal 默认值是 `vernal-context-{epoch_millis}`，可通过

---- launch_returns_shared_ready_context_and_close_remains_explicit stdout ----

thread 'launch_returns_shared_ready_context_and_close_remains_explicit' (5576811) panicked at crates/vernal-context/tests/application_launch.rs:33:5:
assertion `left == right` failed
  left: Created
 right: Ready

failures:
    launch_returns_shared_ready_context_and_close_remains_explicit

test result: FAILED. 4 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
