*** crates/vernal-context/src/application_context.rs:265:9: replace ApplicationContext::set_id with ()

*** mutation diff:
--- crates/vernal-context/src/application_context.rs
+++ replace ApplicationContext::set_id with ()
@@ -257,17 +257,17 @@
     /// [`Self::set_id`] 修改。
     #[must_use]
     pub fn id(&self) -> String {
         self.id.lock().expect("id mutex poisoned").clone()
     }
 
     /// 设置上下文唯一 ID（对标 `ConfigurableApplicationContext#setId`）。
     pub fn set_id(&self, id: impl Into<String>) {
-        *self.id.lock().expect("id mutex poisoned") = id.into();
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// 返回部署该上下文的应用程序名称。
     ///
     /// 对标 Spring `ApplicationContext#getApplicationName()`：默认空字符串，
     /// 由部署环境通过 [`Self::set_application_name`] 设置。
     #[must_use]
     pub fn application_name(&self) -> String {

*** result: Success
