*** crates/vernal-context/src/application_context.rs:435:9: replace ApplicationContext::cancellation_token -> CancellationToken with Default::default()

*** mutation diff:
--- crates/vernal-context/src/application_context.rs
+++ replace ApplicationContext::cancellation_token -> CancellationToken with Default::default()
@@ -427,17 +427,17 @@
         self.container().open_scope_with_cancellation::<S>(
             self.lifecycle().resources().cancellation().child_token(),
         )
     }
 
     /// 返回供组件和适配器派生子令牌的取消令牌。
     #[must_use]
     pub fn cancellation_token(&self) -> CancellationToken {
-        self.lifecycle().resources().cancellation().clone()
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// 返回高层应用建造器创建的 Tokio 任务监督器。
     ///
     /// 低层 `ApplicationContextBuilder` 不捕获 Runtime，因此返回 `None`。高层
     /// 路径返回的对象与注册到 `IoC` 的 `Arc<ManagedTaskSupervisor>` 是同一实例。
     #[must_use]
     pub fn managed_tasks(&self) -> Option<&Arc<ManagedTaskSupervisor>> {

---- listener_failure_cancels_application_and_redacts_default_error_text stdout ----

thread 'listener_failure_cancels_application_and_redacts_default_error_text' (5734033) panicked at crates/vernal-context/tests/application_event_listeners.rs:130:6:
listener failure should cancel application: Elapsed(())

failures:
    listener_failure_cancels_application_and_redacts_default_error_text

test result: FAILED. 5 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.00s

*** result: Failure(101)
