*** crates/vernal-context/src/application_context.rs:444:9: replace ApplicationContext::managed_tasks -> Option<&Arc<ManagedTaskSupervisor>> with None

*** mutation diff:
--- crates/vernal-context/src/application_context.rs
+++ replace ApplicationContext::managed_tasks -> Option<&Arc<ManagedTaskSupervisor>> with None
@@ -436,17 +436,17 @@
     }
 
     /// 返回高层应用建造器创建的 Tokio 任务监督器。
     ///
     /// 低层 `ApplicationContextBuilder` 不捕获 Runtime，因此返回 `None`。高层
     /// 路径返回的对象与注册到 `IoC` 的 `Arc<ManagedTaskSupervisor>` 是同一实例。
     #[must_use]
     pub fn managed_tasks(&self) -> Option<&Arc<ManagedTaskSupervisor>> {
-        self.lifecycle().resources().managed_tasks()
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// 返回受管任务的两阶段停机策略。
     #[must_use]
     pub fn task_shutdown_policy(&self) -> &TaskShutdownPolicy {
         self.lifecycle().resources().task_shutdown_policy()
     }

---- refresh_subscribes_ioc_listener_before_lifecycle_initialize_publishes stdout ----

thread 'refresh_subscribes_ioc_listener_before_lifecycle_initialize_publishes' (5740522) panicked at crates/vernal-context/tests/application_event_listeners.rs:94:14:
managed task supervisor

failures:
    refresh_subscribes_ioc_listener_before_lifecycle_initialize_publishes

test result: FAILED. 5 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
