*** crates/vernal-context/src/application_context.rs:450:9: replace ApplicationContext::task_shutdown_policy -> &TaskShutdownPolicy with Box::leak(Box::new(Default::default()))

*** mutation diff:
--- crates/vernal-context/src/application_context.rs
+++ replace ApplicationContext::task_shutdown_policy -> &TaskShutdownPolicy with Box::leak(Box::new(Default::default()))
@@ -442,17 +442,17 @@
     #[must_use]
     pub fn managed_tasks(&self) -> Option<&Arc<ManagedTaskSupervisor>> {
         self.lifecycle().resources().managed_tasks()
     }
 
     /// 返回受管任务的两阶段停机策略。
     #[must_use]
     pub fn task_shutdown_policy(&self) -> &TaskShutdownPolicy {
-        self.lifecycle().resources().task_shutdown_policy()
+        Box::leak(Box::new(Default::default())) /* ~ changed by cargo-mutants ~ */
     }
 
     /// 返回单个生命周期钩子的执行与 Tokio abort 收口预算。
     ///
     /// 高层建造器会把同一对象注册到 IoC；返回借用确保 Context 启动后策略不可漂移。
     #[must_use]
     pub fn lifecycle_execution_policy(&self) -> &LifecycleExecutionPolicy {
         self.lifecycle().resources().lifecycle_execution_policy()

---- managed_context_injects_tokio_events_cancellation_and_aop_plans stdout ----

thread 'managed_context_injects_tokio_events_cancellation_and_aop_plans' (5747149) panicked at crates/vernal-context/tests/context_components.rs:49:5:
assertion failed: std::ptr::eq(service.task_shutdown_policy.as_ref(),
    context.task_shutdown_policy())

failures:
    managed_context_injects_tokio_events_cancellation_and_aop_plans

test result: FAILED. 1 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
