*** crates/vernal-context/src/application_context.rs:477:9: replace ApplicationContext::environment -> &ApplicationEnvironment with Box::leak(Box::new(Default::default()))

*** mutation diff:
--- crates/vernal-context/src/application_context.rs
+++ replace ApplicationContext::environment -> &ApplicationEnvironment with Box::leak(Box::new(Default::default()))
@@ -469,17 +469,17 @@
 
     /// 返回当前 Context 冻结的应用环境。
     ///
     /// 高层建造器把同一 [`ApplicationEnvironment`] 注册为普通 `IoC` Singleton；
     /// 配置组件可以在同步构造阶段读取类型化属性，生命周期组件和 Adapter 也可以
     /// 通过 Context 门面读取相同的 `PropertySource` 顺序与 Profile。
     #[must_use]
     pub fn environment(&self) -> &ApplicationEnvironment {
-        self.lifecycle().resources().environment()
+        Box::leak(Box::new(Default::default())) /* ~ changed by cargo-mutants ~ */
     }
 
     /// 返回当前 Context 独占的类型化事件总线。
     #[must_use]
     pub fn events(&self) -> &EventBus {
         self.lifecycle().resources().events()
     }

---- definition_conflict_rolls_back_environment_operation_and_module_name stdout ----

thread 'definition_conflict_rolls_back_environment_operation_and_module_name' (5766280) panicked at crates/vernal-context/tests/application_modules.rs:210:14:
retry property: required application property is missing: definition.retry

---- module_atomically_installs_ioc_lifecycle_aop_operation_and_environment stdout ----

thread 'module_atomically_installs_ioc_lifecycle_aop_operation_and_environment' (5766283) panicked at crates/vernal-context/tests/application_modules.rs:59:14:
module property: required application property is missing: commerce.enabled

---- configuration_failure_is_redacted_and_discards_staged_contributions stdout ----

thread 'configuration_failure_is_redacted_and_discards_staged_contributions' (5766279) panicked at crates/vernal-context/tests/application_modules.rs:132:5:
assertion `left == right` failed
  left: None
 right: Some("manual")

failures:
    configuration_failure_is_redacted_and_discards_staged_contributions
    definition_conflict_rolls_back_environment_operation_and_module_name
    module_atomically_installs_ioc_lifecycle_aop_operation_and_environment

test result: FAILED. 4 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
