*** crates/vernal-context/src/application_context.rs:492:9: replace ApplicationContext::scope_cleanup_policy -> &crate::ScopeCleanupPolicy with Box::leak(Box::new(Default::default()))

*** mutation diff:
--- crates/vernal-context/src/application_context.rs
+++ replace ApplicationContext::scope_cleanup_policy -> &crate::ScopeCleanupPolicy with Box::leak(Box::new(Default::default()))
@@ -484,17 +484,17 @@
     }
 
     /// 返回应用作用域共用的异步清理策略。
     ///
     /// 高层建造器默认提供 30 秒上限；调用方可以在构建阶段显式改为其他上限或
     /// 无界等待。返回借用保证运行期间策略不可漂移。
     #[must_use]
     pub fn scope_cleanup_policy(&self) -> &crate::ScopeCleanupPolicy {
-        self.lifecycle().resources().scope_cleanup_policy()
+        Box::leak(Box::new(Default::default())) /* ~ changed by cargo-mutants ~ */
     }
 
     /// 返回高层应用建造器绑定的 Tokio Runtime Handle。
     ///
     /// 通过兼容性低层 API 创建的 Context 不隐式捕获 Runtime，因此返回
     /// `None`；通过 [`crate::VernalApplicationBuilder`] 创建时始终为 `Some`。
     #[must_use]
     pub fn runtime_handle(&self) -> Option<&Handle> {

---- managed_context_injects_tokio_events_cancellation_and_aop_plans stdout ----

thread 'managed_context_injects_tokio_events_cancellation_and_aop_plans' (5784192) panicked at crates/vernal-context/tests/context_components.rs:209:5:
assertion failed: std::ptr::eq(service.scope_cleanup_policy.as_ref(),
    context.scope_cleanup_policy())

failures:
    managed_context_injects_tokio_events_cancellation_and_aop_plans

test result: FAILED. 1 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
