*** crates/vernal-context/src/application_context.rs:501:9: replace ApplicationContext::runtime_handle -> Option<&Handle> with None

*** mutation diff:
--- crates/vernal-context/src/application_context.rs
+++ replace ApplicationContext::runtime_handle -> Option<&Handle> with None
@@ -493,17 +493,17 @@
     }
 
     /// 返回高层应用建造器绑定的 Tokio Runtime Handle。
     ///
     /// 通过兼容性低层 API 创建的 Context 不隐式捕获 Runtime，因此返回
     /// `None`；通过 [`crate::VernalApplicationBuilder`] 创建时始终为 `Some`。
     #[must_use]
     pub fn runtime_handle(&self) -> Option<&Handle> {
-        self.lifecycle().resources().runtime()
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// 返回应用构建阶段预编译的 AOP 调用计划目录。
     #[must_use]
     pub fn invocation_plans(&self) -> &InvocationPlanCatalog {
         self.lifecycle().resources().invocation_plans()
     }

---- managed_context_injects_tokio_events_cancellation_and_aop_plans stdout ----

thread 'managed_context_injects_tokio_events_cancellation_and_aop_plans' (5791318) panicked at crates/vernal-context/tests/context_components.rs:196:5:
assertion failed: context.runtime_handle().is_some()

failures:
    managed_context_injects_tokio_events_cancellation_and_aop_plans

test result: FAILED. 1 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
