*** crates/vernal-context/src/application_context.rs:513:9: replace ApplicationContext::local_invocation_plans -> &vernal_aop::LocalInvocationPlanCatalog with Box::leak(Box::new(Default::default()))

*** mutation diff:
--- crates/vernal-context/src/application_context.rs
+++ replace ApplicationContext::local_invocation_plans -> &vernal_aop::LocalInvocationPlanCatalog with Box::leak(Box::new(Default::default()))
@@ -505,17 +505,17 @@
     #[must_use]
     pub fn invocation_plans(&self) -> &InvocationPlanCatalog {
         self.lifecycle().resources().invocation_plans()
     }
 
     /// 返回应用构建阶段预编译的 Local-AOP 调用计划目录。
     #[must_use]
     pub fn local_invocation_plans(&self) -> &vernal_aop::LocalInvocationPlanCatalog {
-        self.lifecycle().resources().local_invocation_plans()
+        Box::leak(Box::new(Default::default())) /* ~ changed by cargo-mutants ~ */
     }
 
     /// 返回调用时刻的只读、可序列化、脱敏启动报告。
     ///
     /// 返回值是拥有自身数据的快照；后续 start/close 操作只更新 Context 内部
     /// 报告，不会修改调用方已经取得的对象。
     pub async fn startup_report(&self) -> StartupReport {
         let unused_definitions = self.container().unused_definitions();

---- managed_context_injects_tokio_events_cancellation_and_aop_plans stdout ----

thread 'managed_context_injects_tokio_events_cancellation_and_aop_plans' (5805931) panicked at crates/vernal-context/tests/context_components.rs:218:5:
assertion failed: std::ptr::eq(service.local_invocation_plans.as_ref(),
    context.local_invocation_plans())

failures:
    managed_context_injects_tokio_events_cancellation_and_aop_plans

test result: FAILED. 1 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
