*** crates/vernal-context/src/lib.rs:172:5: replace project_status -> &'static str with ""

*** mutation diff:
--- crates/vernal-context/src/lib.rs
+++ replace project_status -> &'static str with ""
@@ -164,10 +164,10 @@
 pub use task_schedule_error::TaskScheduleError;
 pub use task_schedule_mode::TaskScheduleMode;
 pub use task_shutdown_policy::TaskShutdownPolicy;
 pub use vernal_application_builder::VernalApplicationBuilder;
 
 /// 返回应用上下文当前成熟度状态。
 #[must_use]
 pub const fn project_status() -> &'static str {
-    vernal_core::PROJECT_STATUS
+    "" /* ~ changed by cargo-mutants ~ */
 }

---- project_status_returns_static_str stdout ----

thread 'project_status_returns_static_str' (3063852) panicked at crates/vernal-context/tests/value_object_coverage.rs:184:5:
assertion failed: !status.is_empty()

failures:
    project_status_returns_static_str

test result: FAILED. 21 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
