*** crates/vernal-context/src/lib.rs:172:5: replace project_status -> &'static str with "xyzzy"

*** mutation diff:
--- crates/vernal-context/src/lib.rs
+++ replace project_status -> &'static str with "xyzzy"
@@ -164,10 +164,10 @@
 pub use task_schedule_error::TaskScheduleError;
 pub use task_schedule_mode::TaskScheduleMode;
 pub use task_shutdown_policy::TaskShutdownPolicy;
 pub use vernal_application_builder::VernalApplicationBuilder;
 
 /// 返回应用上下文当前成熟度状态。
 #[must_use]
 pub const fn project_status() -> &'static str {
-    vernal_core::PROJECT_STATUS
+    "xyzzy" /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
